{
  "_name_or_path": "FacebookAI/roberta-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "fragment",
    "1": "statement",
    "2": "question",
    "3": "command",
    "4": "rhetorical question",
    "5": "rhetorical command",
    "6": "intonation-dependent utterance"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "command": 3,
    "fragment": 0,
    "intonation-dependent utterance": 6,
    "question": 2,
    "rhetorical command": 5,
    "rhetorical question": 4,
    "statement": 1
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.42.4",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
